distributed_application/readme.html

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<title>Distributed Applications</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Distributed Applications"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-07 六"/>
<meta name="author" content="纪秀峰"/>
<meta name="description" content="erlang Distributed Applications"/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Distributed Applications</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">distributed application 某节点挂了后，此种application 会在另外一个节点上启动</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">distributed application 某节点挂了后，此种application 会在另外一个节点上启动</h2>
<div class="outline-text-2" id="text-1">

<p> <a href="http://www.erlang.org/doc/design_principles/distributed_applications.html">http://www.erlang.org/doc/design\_principles/distributed\_applications.html</a><br/>
 <a href="http://learnyousomeerlang.com/distributed-otp-applications">http://learnyousomeerlang.com/distributed-otp-applications</a><br/>
</p><blockquote>

<p>distributed = [{Application, [Timeout,] NodeDesc}]<br/>
                                        NodeDesc = [Node | {Node,&hellip;,Node}]<br/>
</p>
</blockquote>


<p><br/>
 NodeDesc 表示此种Application可以在哪些节点上启动，优先级按NodeDesc[]中出现的顺序而定，但在{} 中的节点优先级相同<br/>
 比如:<br/>
</p>
<p><br/>
<pre class="src src-erlang">{distributed, [{game_log_server, 5000, [<span class="org-string">'emacs@localhost'</span>, {<span class="org-string">'c@localhost'</span>,<span class="org-string">'c2@localhost'</span>,<span class="org-string">'c3@localhost'</span> }]}]}
</pre>

  game_log_server 会优先在'emacs@localhost'上启动，当'emacs@localhost'当掉后，会从{'c@localhost','c2@localhost','c3@localhost' }<br/>
 中选择一个节点，在此节点上启动game_log_server application<br/>
 Timeout<br/>
  表示等待多少ms 才决定在其他节点上来启动此 application(即当前节点或许会在<br/>
 Timeout时间内重启成功。如果当前节点在timeout时间内恢复了，则在此节点上启动<br/>
 （个人理解）)<br/>
</p><blockquote>

<p>sync_nodes_mandatory = [Node]<br/>
    Specifies which other nodes must be started (within the timeout specified by sync_nodes_timeout.<br/>
sync_nodes_optional = [Node]<br/>
    Specifies which other nodes can be started (within the timeout specified by sync_nodes_timeout.<br/>
sync_nodes_timeout = integer() | infinity<br/>
    Specifies how many milliseconds to wait for the other nodes to start.<br/>
</p>
</blockquote>


<p><br/>
 When started, the node will wait for all nodes specified by sync_nodes_mandatory and sync_nodes_optional to come up<br/>
 在启动当前节点的过程中，会等待 sync_nodes_mandatory 与 sync_nodes_optional属性中指定的节点启动后才启动,如果sync_nodes_mandatory<br/>
 中有任一节点启动失败，则此停止此节点的启动<br/>
 所有这些节点中<br/>
 distributed and sync_nodes_timeout,两属性的值必须相同.<br/>
 当所有distributed属性中指定的节点启动成功后，此 application会首先在<br/>
 emacs@localhost上启动<br/>
</p>
<p><br/>
master.config<br/>
</p>
<p><br/>
<pre class="src src-erlang"> [{kernel,
  [{distributed, [{distributed_application, 5000, [<span class="org-string">'emacs@localhost'</span>, {<span class="org-string">'c@localhost'</span>,<span class="org-string">'c2@localhost'</span> }]}]},
   {sync_nodes_mandatory, [<span class="org-string">'c@localhost'</span>,<span class="org-string">'c2@localhost'</span> ]},
   {sync_nodes_timeout, 30000}
  ]
 }
].
</pre>


c.config<br/>
</p>
<p><br/>
<pre class="src src-erlang">[{kernel,
  [{distributed, [{distributed_application, 5000, [<span class="org-string">'emacs@localhost'</span>, {<span class="org-string">'c@localhost'</span>,<span class="org-string">'c2@localhost'</span> }]}]},
   {sync_nodes_mandatory, [<span class="org-string">'c2@localhost'</span>,<span class="org-string">'emacs@localhost'</span> ]},
   {sync_nodes_timeout, 30000}
  ]
 }
].
</pre>

c2.config<br/>
</p>
<p><br/>
<pre class="src src-erlang">[{kernel,
  [{distributed, [{distributed_application, 5000, [<span class="org-string">'emacs@localhost'</span>, {<span class="org-string">'c@localhost'</span>,<span class="org-string">'c2@localhost'</span> }]}]},
   {sync_nodes_mandatory, [<span class="org-string">'c@localhost'</span>,<span class="org-string">'emacs@localhost'</span> ]},
   {sync_nodes_timeout, 30000}
  ]
 }
].
</pre>


<pre class="src src-sh">erl -sname emacs@localhost -config master.config -pa ebin
erl -sname c@localhost -config c.config -pa ebin
erl -sname c2@localhost -config c2.config -pa ebin
</pre>

依次在三个终端上运行以上，三个终端会等待其他节点启动，即，只有三个节点在<br/>
30000ms内同时启动<br/>
三个终端启动成功后在每个节点上运行<br/>
</p>
<p><br/>
<pre class="src src-erlang"><span class="org-type">application</span>:<span class="org-type">start</span>(distributed_application).
</pre>

但是你会发现，只有 emacs@localhost上真正运行了<br/>
(Distributed Applications 有两有状态started ,running).<br/>
当在每个节点上运行application:start(distributed_application).<br/>
时，只有主节点上的distributed_application达到了running状态，其他节点都是<br/>
started 状态 ，started 状态的distributed_application 基本没运行过<br/>
distributed_application的代码。running状态的application 运行了<br/>
</p>
<p><br/>
<pre class="src src-erlang"><span class="org-type">distributed_application_app</span>:<span class="org-type">start</span>(normal,<span class="org-variable-name">_Args</span>).
</pre>

此后让 emacs@localhost挂掉后，一段时间 内，你会发现 c2@localhost c@localhost<br/>
其中之一运行了<br/>
distributed_application_app:start(normal,_Args).<br/>
然后重启 emacs@localhost,并在其上启动distributed_application<br/>
</p>
<p><br/>
<pre class="src src-sh">erl -sname emacs@localhost -config master.config -pa ebin
application:start(distributed_application).
</pre>

你会发现 emacs@localhost 启动后，运行了以下代码<br/>
</p>
<p><br/>
<pre class="src src-erlang"><span class="org-type">distributed_application_app</span>:<span class="org-type">start</span>({takeover,<span class="org-variable-name">Node</span>},<span class="org-variable-name">_Args</span>).
</pre>

并且在 c2@localhost 上运行了<br/>
</p>
<p><br/>
<pre class="src src-erlang">distributed_application_app:<span class="org-type">stop/1</span>.
</pre>

即， application从c2@localhost 转移到了 emacs@localhost<br/>
</p>
<p><br/>
 application:start(Application)<br/>
 Module:start(normal, StartArgs)<br/>
 当 emacs@localhost 当掉后,首先会尝试在等5000ms 让 emacs@localhost重启。<br/>
 application会在新的节点上以<br/>
 Module:start(normal, StartArgs)的方式重启，<br/>
 例外是如果此 application 定义的tart_phases(<a href="http://www.erlang.org/doc/design_principles/included_applications.html">http://www.erlang.org/doc/design\_principles/included\_applications.html</a>)<br/>
 则 Module:start({failover, Node}, StartArgs)<br/>
</p>
<p><br/>
 如果 emacs@localhost重启了。则此时 Takeover 事件会发生，即此 application会在 emacs@localhost 上重启，而 在old node<br/>
 上stop<br/>
 Module:start({takeover, Node}, StartArgs)<br/>
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-07 六</p>
<p class="author">Author: 纪秀峰</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>


</div>
<p><br/><br/>
<!-- hhmts start --> <!-- hhmts end --></p>

</body>
</html>
